Revit 2027 API
Rebar.FreeForm3DPathServerGuid Property
 Guid used for identifying the external IRebarUpdateServer for computing 3D Path Free Form Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Guid FreeForm3DPathServerGuid { get; }
Public Shared ReadOnly Property FreeForm3DPathServerGuid As Guid
	Get
public:
static property Guid FreeForm3DPathServerGuid {
	Guid get ();
}
static member FreeForm3DPathServerGuid : Guid with get
Property Value
Guid
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace